---
kind: property
id: P:Autodesk.Revit.DB.CategoryNameMap.Item(System.String)
source: html/5c189fd7-6881-976e-5ab1-ffd349c67ef3.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Item Property

Gets or sets a category at a specified name within the map.

## Syntax (C#)
```csharp
public virtual Category this[
	string key
] { get; set; }
```

## Parameters
- **key** (`System.String`) - The name of the category to be set or retrieved.

## Returns
Returns the category at the specified name.